# 만들어야할 항목

"""
# 현재 리스트 
pr_00_list.py   
pr_01_print_func.py  -> 추가필요) 함수에 대한 설명  
pr_02_entry_point.py  
pr_03_path.py
"""

"""
추가해야할 항목
# - 변수선언 -> 전역변수, 매직넘버 등등  
# - input  -> 메뉴작성후 선택 받을때 input 
# - while 문  / break -> main.py 메뉴 작성이후에 돌릴때 기본 실행 때 사용 / break - 자신이 속한 범위 내에서 가장 안쪽의 반복문 강제 탈출 후 다음 코드로 넘어감. 
# - 함수란?  자주 사용하는 코드나 특정한 작업 수행 코드를 하나로 묶어둔 재사용 가능한 코드 상자. 
# - 기본 내장 함수 -> strip
# - if ~ elif  ~ else 구문
# - try ~ except 구문
# - 사용자 정의 함수 (함수란? )
# - callback 함수
# - 파이썬 데이터 형식  (dict, list) - list ( [] , 인덱스 접근, 순서중요시 or 여러개의 데이터 일렬 나열시 사용) , dict( {}  k-v 쌍, 키 이름으로 접근 , 고유한 이름을 붙여서 객체 속성이나 상세 정보 관리시 사용)
# - __init__ 의 의미 : 파이썬 클래스 안에서 쓰이는 생성자(constructor) 메서드 / initialization의 줄임말 / 동작방식 : 클래스를 이용해 객체(인스턴스)를 만드는 순간 파이썬이 가장 먼저 호출해주는 특수한 함수 / 주요 역할 : 객체가 만들어질때 그 객체가 가져야할 기본 데이터 (속성_변수)들을 세팅(초기화)함. 
# - __ (던더,dunder) 란? :  파이썬 내부에서 이미 용도를 정해둔 특수한 이름. double underscore 의 줄임말. 앞뒤로 붙은 __ 언더스코어 두개.
# - 클래스란? : 객체를 만들기 위한 설계도  / 붕어빵틀(클래스) , 붕어빵(객체)
# - 메서드란? 클래스 내부에 정의된 함수. 함수와 기본구조는 똑같지만, 특정 클래스(객체)에 소속되어 그 객체의 데이터를 조작하거나 특정행동을 수행하는 함수를 메서드라고함.  / 붕어빵이 차갑게 식었을경우 데우라는 명령어 warm_up()
# # - 던더 메서드 / 매직 메서드 
# - 상속
# - 아키텍쳐 - Model, Controller
# - enumerate() 
# - from ~ import
# - 폴더구조 
# - rtval 에 할당해서 보내기 금지 
# - validaton
# - short circuit
# - isinstance()
# - Error 종류 ( TypeError, Value Error)
# - raise
# - slicing
# - 3항 연산자 
"""